Repository: imcat-owo/dudu-native
Catalog: Dudu/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# apigroup.diag.fail
source: Failed
zh_hans: 失败
zh_hant: 失敗

# apigroup.diag.ok
source: OK
zh_hans: 成功
zh_hant: 成功

# apigroup.diag.title
source: Diagnostic log
zh_hans: 诊断日志
zh_hant: 診斷日誌

# apigroup.diag.view
source: View log
zh_hans: 看看日志
zh_hant: 看看日誌

# apigroup.edit
source: Edit group
zh_hans: 编辑分组
zh_hant: 編輯分組

# apigroup.empty
source: No API group yet. Add one so I can get things done for you.
zh_hans: 还没配 API 分组。加一个，我才能替你办事。
zh_hant: 還沒配 API 分組。加一個，我才能替你辦事。

# apigroup.extras.desc
source: Top-level params merged into every request — for gateways that need something special. Must be valid JSON.
zh_hans: 每次请求都带上的顶层参数，网关要啥特殊的就写这儿。得是合法 JSON。
zh_hant: 每次請求都帶上的頂層參數，網關要啥特殊的就寫這兒。得是合法 JSON。

# apigroup.extras.invalid
source: That's not valid JSON — I didn't save it: %1$@
zh_hans: 这不是合法 JSON，我没敢存：%1$@
zh_hant: 這不是合法 JSON，我沒敢存：%1$@

# apigroup.extras.needObject
source: Must be a JSON object
zh_hans: 得是个 JSON 对象
zh_hant: 得是個 JSON 對象

# apigroup.extras.title
source: Extra request params
zh_hans: 额外请求参数
zh_hant: 額外請求參數

# apigroup.headerKeyPh
source: Header name
zh_hans: Header 名
zh_hant: Header 名

# apigroup.headerValuePh
source: Value
zh_hans: 值
zh_hant: 值

# apigroup.headers
source: Custom headers (optional)
zh_hans: 自定义请求头（可选）
zh_hant: 自定義請求頭（可選）

# apigroup.keys.add
source: Add a key
zh_hans: 加一个 key
zh_hant: 加一個 key

# apigroup.keys.autoDisableAfter
source: Failures before auto-disable
zh_hans: 连跪几次停用它
zh_hant: 連跪幾次停用它

# apigroup.keys.delete
source: Delete key
zh_hans: 删除 key
zh_hant: 刪除 key

# apigroup.keys.deleteConfirm
source: Delete this key?
zh_hans: 删掉这个 key？
zh_hant: 刪掉這個 key？

# apigroup.keys.desc
source: Rotate through multiple keys — when one fails, the next takes over. Leave empty to just use the single key above.
zh_hans: 多个 key 轮着用，哪个挂了自动换下一个。留空就只用上面的单个 key。
zh_hant: 多個 key 輪着用，哪個掛了自動換下一個。留空就只用上面的單個 key。

# apigroup.keys.editKey
source: Edit
zh_hans: 改
zh_hant: 改

# apigroup.keys.keyPh
source: Paste the key — stored on this phone only
zh_hans: 粘贴 key，只存本机
zh_hant: 粘貼 key，只存本機

# apigroup.keys.namePh
source: Label, e.g. main
zh_hans: 备注名，比如：主号
zh_hant: 備註名，比如：主號

# apigroup.keys.priorityLabel
source: Priority (1–10, smaller goes first)
zh_hans: 优先级（1–10，越小越先用）
zh_hant: 優先級（1–10，越小越先用）

# apigroup.keys.recoverMinutes
source: Minutes before retry
zh_hans: 停用后几分钟再试
zh_hant: 停用後幾分鐘再試

# apigroup.keys.rotation.leastUsed
source: Least used first
zh_hans: 用得少的先
zh_hant: 用得少的先

# apigroup.keys.rotation.priority
source: By priority
zh_hans: 按优先级
zh_hant: 按優先級

# apigroup.keys.rotation.random
source: Random
zh_hans: 随机
zh_hant: 隨機

# apigroup.keys.rotation.roundRobin
source: Round-robin
zh_hans: 轮询
zh_hant: 輪詢

# apigroup.keys.rotationLabel
source: Rotation
zh_hans: 轮换方式
zh_hant: 輪換方式

# apigroup.keys.saveKey
source: Save this key
zh_hans: 存这个 key
zh_hant: 存這個 key

# apigroup.keys.statusAutoDisabled
source: Auto-disabled after failures — back in %1$@ min
zh_hans: 连跪被停用了，%1$@ 分钟后自动回来
zh_hant: 連跪被停用了，%1$@ 分鐘後自動回來

# apigroup.keys.statusDisabled
source: Paused
zh_hans: 歇着呢
zh_hant: 歇着呢

# apigroup.keys.statusOk
source: Healthy
zh_hans: 正常
zh_hant: 正常

# apigroup.keys.title
source: Key pool
zh_hans: Key 池
zh_hant: Key 池

# apigroup.keys.unnamed
source: Unnamed
zh_hans: 没起名
zh_hant: 沒起名

# apigroup.model
source: Model
zh_hans: 模型
zh_hant: 模型

# apigroup.modelPh
source: e.g. gpt-4o-mini
zh_hans: 例如：gpt-4o-mini
zh_hant: 例如：gpt-4o-mini

# apigroup.name
source: Name
zh_hans: 名称
zh_hant: 名稱

# apigroup.namePh
source: e.g. Primary
zh_hans: 例如：主力
zh_hant: 例如：主力

# apigroup.noActive
source: Connect a model for %1$@ first
zh_hans: 先给%1$@接上模型
zh_hant: 先給%1$@接上模型

# apigroup.oauth.cancelled
source: Cancelled — didn't sign in this time
zh_hans: 取消了，这次没登上
zh_hant: 取消了，這次沒登上

# apigroup.oauth.desc
source: Sign in with your account — no API key needed. Tokens stay in this phone's encrypted storage.
zh_hans: 用账号直接登录，不用粘 key。token 只存本机加密存储。
zh_hant: 用賬號直接登錄，不用粘 key。token 只存本機加密存儲。

# apigroup.oauth.failed
source: Sign-in failed: %1$@
zh_hans: 没登上：%1$@
zh_hant: 沒登上：%1$@

# apigroup.oauth.linked
source: Signed in: %1$@
zh_hans: 已登录：%1$@
zh_hant: 已登錄：%1$@

# apigroup.oauth.loggingIn
source: Opening the browser…
zh_hans: 正在打开浏览器…
zh_hant: 正在打開瀏覽器…

# apigroup.oauth.login
source: Sign in with %1$@
zh_hans: 用 %1$@ 登录
zh_hant: 用 %1$@ 登錄

# apigroup.oauth.logout
source: Sign out
zh_hans: 退出登录
zh_hant: 退出登錄

# apigroup.oauth.logoutConfirm
source: Sign out of %1$@? The token will be deleted from this phone, and chats won't be able to use it.
zh_hans: 退出 %1$@ 的登录？token 会从本机删掉，之后聊天就用不了它了。
zh_hant: 退出 %1$@ 的登錄？token 會從本機刪掉，之後聊天就用不了它了。

# apigroup.oauth.reNote
source: Honest note: these logins use reverse-engineered endpoints, not public APIs — they can break whenever the provider changes them. An API key is the steadier choice.
zh_hans: 老实说：这些登录走的是逆向出来的接口，不是官方公开的，厂商一改就可能抽风。求稳的话还是用 API key。
zh_hant: 老實說：這些登錄走的是逆向出來的接口，不是官方公開的，廠商一改就可能抽風。求穩的話還是用 API key。

# apigroup.oauth.title
source: Log in without a key
zh_hans: 免 Key 登录
zh_hant: 免 Key 登錄

# apigroup.onboardBody
source: Dudu needs a model connected to chat with you. Tap the button below and fill in the address, key and model name from your model provider — stored safely on your phone.
zh_hans: 嘟嘟要连上模型才能陪你聊天。点下面的按钮，把模型服务商给你的地址、钥匙和模型名填进来就行，存在你手机里，很安全。
zh_hant: 嘟嘟要連上模型才能陪你聊天。點下面的按鈕，把模型服務商給你的地址、鑰匙和模型名填進來就行，存在你手機裏，很安全。

# apigroup.pgroups.add
source: Create
zh_hans: 新建
zh_hant: 新建

# apigroup.pgroups.delete
source: Delete group
zh_hans: 删除分组
zh_hant: 刪除分組

# apigroup.pgroups.deleteConfirm
source: Delete "%1$@"? The connections inside stay untouched.
zh_hans: 删掉「%1$@」？里面的连接不会动。
zh_hant: 刪掉「%1$@」？裏面的連接不會動。

# apigroup.pgroups.desc
source: Sort connections into your own buckets — tag a group with the same name and it lands here automatically. When the active connection gets rate-limited or goes down, it automatically fails over to the next one in its bucket.
zh_hans: 给连接分几个自己的篮子，编辑分组时打上同名标签就自动归进去。当前连接被限流或挂掉时，会自动切到同篮子的下一个。
zh_hant: 給連接分幾個自己的籃子，編輯分組時打上同名標籤就自動歸進去。當前連接被限流或掛掉時，會自動切到同籃子的下一個。

# apigroup.pgroups.empty
source: No custom groups yet
zh_hans: 还没建分组
zh_hant: 還沒建分組

# apigroup.pgroups.members
source: %1$@ connections
zh_hans: %1$@ 个连接
zh_hant: %1$@ 個連接

# apigroup.pgroups.namePh
source: Group name, e.g. freebies
zh_hans: 分组名，比如：白嫖
zh_hant: 分組名，比如：白嫖

# apigroup.pgroups.title
source: My groups
zh_hans: 我的分组
zh_hant: 我的分組

# apigroup.pgroups.use
source: Switch to this group
zh_hans: 切到这个分组
zh_hant: 切到這個分組

# apigroup.pickModel
source: Models on this server — just tap one
zh_hans: 服务器上有的模型，点一个就行
zh_hant: 服務器上有的模型，點一個就行

# apigroup.profileNote
source: Working config Dudu remembers
zh_hans: 嘟嘟记住的可用配置
zh_hant: 嘟嘟記住的可用配置

# apigroup.profileReset
source: Reset learned config
zh_hans: 重置学习记录
zh_hant: 重置學習記錄

# apigroup.sampling.desc
source: Empty means the vendor default — I won't send the parameter.
zh_hans: 不填就是厂商默认，我不发这个参数。
zh_hant: 不填就是廠商默認，我不發這個參數。

# apigroup.sampling.reset
source: Default
zh_hans: 用默认
zh_hant: 用默認

# apigroup.sampling.title
source: Sampling
zh_hans: 采样参数
zh_hant: 採樣參數

# apigroup.save
source: Save
zh_hans: 保存
zh_hant: 保存

# apigroup.share.cameraDenied
source: Camera permission needed to scan
zh_hans: 没拿到相机权限，开了才能扫码
zh_hant: 沒拿到相機權限，開了才能掃碼

# apigroup.share.desc
source: Send this config to someone, or bring one in from them.
zh_hans: 把这份配置发给别人，或从别人那儿拿一份进来。
zh_hant: 把這份配置發給別人，或從別人那兒拿一份進來。

# apigroup.share.headersStripped
source: Heads-up: the sharer didn't include custom headers (kept private) — add them manually if this config needs them.
zh_hans: 提醒一下：对方分享时没带自定义请求头（出于安全没分享），这个配置如果需要的话请手动补上。
zh_hant: 提醒一下：對方分享時沒帶自定義請求頭（出於安全沒分享），這個配置如果需要的話請手動補上。

# apigroup.share.import
source: Import this config
zh_hans: 导入这份配置
zh_hant: 導入這份配置

# apigroup.share.imported
source: Got it — look it over, then save
zh_hans: 拿到了，检查下没问题就保存
zh_hant: 拿到了，檢查下沒問題就保存

# apigroup.share.invalid
source: I can't read that — not a valid share
zh_hans: 这串东西我看不懂，不是有效的分享
zh_hant: 這串東西我看不懂，不是有效的分享

# apigroup.share.keyWarning
source: Heads up: keys in the QR code are plain text. One screenshot and the key is gone — only share with people you trust.
zh_hans: 提醒：二维码里的 key 是明文。截图一发，key 就送人了，只给信得过的人。
zh_hant: 提醒：二維碼裏的 key 是明文。截圖一發，key 就送人了，只給信得過的人。

# apigroup.share.openSettings
source: Open Settings to enable the camera
zh_hans: 去设置开启相机权限
zh_hant: 去設定開啟相機權限

# apigroup.share.pastePh
source: Or paste the share text here
zh_hans: 或者把分享文本粘这儿
zh_hant: 或者把分享文本粘這兒

# apigroup.share.qr
source: Make a share QR code
zh_hans: 生成分享二维码
zh_hant: 生成分享二維碼

# apigroup.share.scan
source: Scan to import
zh_hans: 扫码导入
zh_hant: 掃碼導入

# apigroup.share.title
source: Share / import
zh_hans: 分享 / 导入
zh_hant: 分享 / 導入

# apigroup.share.withKeys
source: Include keys in the share
zh_hans: 连 key 一起分享
zh_hant: 連 key 一起分享

# apigroup.slot.compress
source: Compress context
zh_hans: 压缩上下文
zh_hant: 壓縮上下文

# apigroup.slot.memory
source: Memory
zh_hans: 记事情
zh_hant: 記事情

# apigroup.slot.suggest
source: Suggestions
zh_hans: 出主意
zh_hant: 出主意

# apigroup.slot.summary
source: Summaries
zh_hans: 写摘要
zh_hant: 寫摘要

# apigroup.slot.title
source: Titles
zh_hans: 起标题
zh_hant: 起標題

# apigroup.slots.desc
source: Give small jobs to small models and save the big one. Empty follows the active group.
zh_hans: 小活儿派给小模型，省着点花。留空就跟随当前分组。
zh_hant: 小活兒派給小模型，省着點花。留空就跟隨當前分組。

# apigroup.slots.modelPh
source: Model name — empty follows the group
zh_hans: 模型名，空着跟分组走
zh_hant: 模型名，空着跟分組走

# apigroup.slots.save
source: Save duties
zh_hans: 保存分工
zh_hant: 保存分工

# apigroup.slots.saved
source: Saved
zh_hans: 存好了
zh_hant: 存好了

# apigroup.slots.title
source: Model duties
zh_hans: 模型分工
zh_hant: 模型分工

# apigroup.speed.fail
source: Didn't make it: %1$@
zh_hans: 没跑通：%1$@
zh_hant: 沒跑通：%1$@

# apigroup.speed.preview
source: Reply
zh_hans: 回包
zh_hant: 回包

# apigroup.speed.test
source: Run once
zh_hans: 跑一次
zh_hant: 跑一次

# apigroup.speed.testing
source: Running…
zh_hans: 跑着呢…
zh_hant: 跑着呢…

# apigroup.speed.title
source: Speed test
zh_hans: 测速
zh_hant: 測速

# apigroup.speed.total
source: Total
zh_hans: 总耗时
zh_hant: 總耗時

# apigroup.speed.ttfb
source: First byte
zh_hans: 首字节
zh_hant: 首字節

# apigroup.subtitle
source: Model connections, stored encrypted on-device
zh_hans: 模型连接配置，存本机加密存储
zh_hant: 模型連接配置，存本機加密存儲

# apigroup.test
source: Test connection
zh_hans: 测试连接
zh_hant: 測試連接

# apigroup.testFail
source: Failed: %1$@
zh_hans: 连接失败：%1$@
zh_hant: 連接失敗：%1$@

# apigroup.testFailAuth
source: The key looks wrong or lacks permission. Re-paste the key in the group and double-check the address.
zh_hans: Key 不对或没权限。去分组里重新粘一下 key，顺便看看地址对不对。
zh_hant: Key 不對或沒權限。去分組裏重新粘一下 key，順便看看地址對不對。

# apigroup.testFailNetwork
source: Can't reach that address. Check your network and the address spelling.
zh_hans: 连不上这个地址。检查一下网络，再看看地址有没有打错。
zh_hant: 連不上這個地址。檢查一下網絡，再看看地址有沒有打錯。

# apigroup.testFailRate
source: Rate-limited — take a break and try again later.
zh_hans: 被限流了，歇一会儿再试。
zh_hant: 被限流了，歇一會兒再試。

# apigroup.testOk
source: Connected
zh_hans: 连接成功
zh_hant: 連接成功

# apigroup.thinkingMode
source: Thinking
zh_hans: 思考过程
zh_hant: 思考過程

# apigroup.thinkingMode.auto
source: Auto (show when supported)
zh_hans: 自动（能显示就显示）
zh_hant: 自動（能顯示就顯示）

# apigroup.thinkingMode.off
source: Off
zh_hans: 关闭
zh_hant: 關閉

# apigroup.thinkingMode.on
source: Force on
zh_hans: 强制开启
zh_hant: 強制開啓

# apigroup.title
source: API Groups
zh_hans: API 分组
zh_hant: API 分組

# apigroup.toolsMode
source: Tool calls
zh_hans: 工具调用
zh_hant: 工具調用

# apigroup.toolsMode.auto
source: Auto (on when supported)
zh_hans: 自动（能用就用）
zh_hant: 自動（能用就用）

# apigroup.toolsMode.off
source: Off
zh_hans: 关闭
zh_hant: 關閉

# apigroup.toolsMode.on
source: Force on
zh_hans: 强制开启
zh_hant: 強制開啓

# apigroup.usage.clear
source: Clear
zh_hans: 清零
zh_hant: 清零

# apigroup.usage.clearConfirm
source: Clear all usage records?
zh_hans: 用量记录全清掉？
zh_hant: 用量記錄全清掉？

# apigroup.usage.desc
source: Estimated from public pricing — for reference only; the provider's bill is the truth.
zh_hans: 按公开价格表估算，仅供参考，实际以厂商账单为准。
zh_hant: 按公開價格表估算，僅供參考，實際以廠商賬單爲準。

# apigroup.usage.empty
source: Nothing spent yet
zh_hans: 还没花过一分钱
zh_hant: 還沒花過一分錢

# apigroup.usage.requests
source: Requests
zh_hans: 请求数
zh_hant: 請求數

# apigroup.usage.title
source: Usage ledger
zh_hans: 用量账本
zh_hant: 用量賬本

# apigroup.usage.tokens
source: Total tokens
zh_hans: 累计 token
zh_hant: 累計 token

# apigroup.usage.total
source: Total spend (est.)
zh_hans: 累计花费（估）
zh_hant: 累計花費（估）

# apigroup.userAgent.label
source: User-Agent (optional)
zh_hans: User-Agent（可选）
zh_hant: User-Agent（可選）

# apigroup.userAgent.ph
source: Leave empty for the default
zh_hans: 留空就用默认的
zh_hant: 留空就用默認的

# apigroup.usergroup.label
source: Group tag
zh_hans: 分组标签
zh_hant: 分組標籤

# apigroup.usergroup.ph
source: e.g. main
zh_hans: 比如：主力
zh_hant: 比如：主力

# apigroup.validation.baseUrlInvalid
source: Base URL must start with http(s)
zh_hans: 接口地址格式不对，要 http(s) 开头
zh_hant: 接口地址格式不對，要 http(s) 開頭

# apigroup.validation.baseUrlRequired
source: Base URL is required
zh_hans: 请填写接口地址
zh_hant: 請填寫接口地址

# apigroup.validation.modelRequired
source: Model name is required
zh_hans: 请填写模型名
zh_hant: 請填寫模型名

# apigroup.validation.nameRequired
source: Name is required
zh_hans: 请填写名称
zh_hant: 請填寫名稱

# apigroup.vendor.custom
source: Custom
zh_hans: 自定义
zh_hant: 自定義

# apigroup.vendor.openai
source: OpenAI-compatible
zh_hans: OpenAI 兼容
zh_hant: OpenAI 兼容

# app.name
source: Dudu
zh_hans: 嘟嘟
zh_hant: 嘟嘟

# app.tagline
source: A little room for your day.
zh_hans: 给你的一天，留个小房间。
zh_hant: 給你的一天，留個小房間。

# appearance.accent
source: Accent
zh_hans: 点缀色
zh_hant: 點綴色

# appearance.aiAvatar
source: AI avatar
zh_hans: AI 头像
zh_hant: AI 頭像

# appearance.aiModeCreative
source: Creative
zh_hans: 创意
zh_hant: 創意

# appearance.aiModeCreativeDesc
source: Steady plus custom CSS touches and pulling palettes from images.
zh_hans: 稳态全部能力，外加自定义 CSS 和从图片取色。
zh_hant: 穩態全部能力，外加自定義 CSS 和從圖片取色。

# appearance.aiModeLabel
source: AI theme studio
zh_hans: AI 换肤
zh_hant: AI 換膚

# appearance.aiModeOff
source: Off
zh_hans: 关
zh_hant: 關

# appearance.aiModeOffDesc
source: The AI cannot see or touch theme tools.
zh_hans: AI 看不到也用不了换肤工具。
zh_hant: AI 看不到也用不了換膚工具。

# appearance.aiModeStable
source: Steady
zh_hans: 稳态
zh_hant: 穩態

# appearance.aiModeStableDesc
source: The AI can restyle colors, wallpaper and avatars with a try-on preview you confirm.
zh_hans: AI 可以换配色、壁纸和头像，每次先试穿、由你确认。
zh_hant: AI 可以換配色、壁紙和頭像，每次先試穿、由你確認。

# appearance.aiThemeLabel
source: AI theming
zh_hans: AI 换肤
zh_hant: AI 換膚

# appearance.aiThemeMode.creative
source: Creative
zh_hans: 创意
zh_hant: 創意

# appearance.aiThemeMode.off
source: Off
zh_hans: 关
zh_hant: 關

# appearance.aiThemeMode.stable
source: Stable
zh_hans: 稳态
zh_hant: 穩態

# appearance.aiThemeNote
source: In Stable the AI can only adjust colors; Creative also lets it write theme CSS; Off hides theming tools from the AI
zh_hans: 稳态下 AI 只能调配色；创意模式还允许 AI 写主题 CSS；关闭后 AI 看不到换肤工具
zh_hant: 穩態下 AI 只能調配色；創意模式還允許 AI 寫主題 CSS；關閉後 AI 看不到換膚工具

# appearance.applied
source: Applied
zh_hans: 已应用
zh_hant: 已應用

# appearance.appliedLocal
source: Applied locally; cloud sync failed
zh_hans: 已应用到本机，云端同步失败
zh_hant: 已應用到本機，雲端同步失敗

# appearance.apply
source: Apply
zh_hans: 应用
zh_hant: 應用

# appearance.avatarLabel
source: Avatars
zh_hans: 头像
zh_hant: 頭像

# appearance.changeImage
source: Change image
zh_hans: 更换图片
zh_hant: 更換圖片

# appearance.customLabel
source: Custom colors
zh_hans: 自定义配色
zh_hant: 自定義配色

# appearance.dimLabel
source: Dim
zh_hans: 压暗
zh_hant: 壓暗

# appearance.discard
source: Discard
zh_hans: 放弃
zh_hant: 放棄

# appearance.discarded
source: Try-on discarded
zh_hans: 已放弃试穿
zh_hant: 已放棄試穿

# appearance.entryDetail
source: Themes, wallpaper & avatars
zh_hans: 主题、壁纸、头像
zh_hant: 主題、壁紙、頭像

# appearance.entryTitle
source: Appearance
zh_hans: 外观
zh_hant: 外觀

# appearance.fontCurrent
source: Current font
zh_hans: 当前字体
zh_hant: 當前字體

# appearance.fontFailed
source: Invalid font file — try another
zh_hans: 字体文件无效，请换一个
zh_hant: 字體文件無效，請換一個

# appearance.fontLabel
source: Font
zh_hans: 字体
zh_hant: 字體

# appearance.fontLoaded
source: Font applied
zh_hans: 字体已应用
zh_hant: 字體已應用

# appearance.fontNote
source: Uploaded fonts live outside theme packs and are managed separately; missing glyphs fall back to the system font
zh_hans: 上传的字体存在主题包之外，单独管理；缺字自动回退系统字体
zh_hant: 上傳的字體存在主題包之外，單獨管理；缺字自動回退系統字體

# appearance.fontRestore
source: Restore system font
zh_hans: 恢复系统字体
zh_hant: 恢復系統字體

# appearance.fontSize.large
source: Large
zh_hans: 大
zh_hant: 大

# appearance.fontSize.small
source: Small
zh_hans: 小
zh_hant: 小

# appearance.fontSize.standard
source: Standard
zh_hans: 标准
zh_hant: 標準

# appearance.fontSize.system
source: System
zh_hans: 跟随系统
zh_hant: 跟隨系統

# appearance.fontSizeLabel
source: Text size
zh_hans: 字号
zh_hant: 字號

# appearance.fontSystem
source: System default
zh_hans: 系统默认
zh_hant: 系統默認

# appearance.fontUpload
source: Upload font file
zh_hans: 上传字体文件
zh_hant: 上傳字體文件

# appearance.hexHint
source: Enter a 6-digit hex, e.g. 3F9B8A
zh_hans: 输入 6 位颜色码，如 3F9B8A
zh_hant: 輸入 6 位顏色碼，如 3F9B8A

# appearance.historyCurrent
source: Current
zh_hans: 当前
zh_hant: 當前

# appearance.historyEmpty
source: No previous versions yet — confirm a theme and they'll appear
zh_hans: 还没有历史版本，确认一次主题后会出现
zh_hant: 還沒有歷史版本，確認一次主題後會出現

# appearance.historyLabel
source: Version history
zh_hans: 版本历史
zh_hant: 版本歷史

# appearance.historyRestore
source: Restore this version
zh_hans: 恢复此版
zh_hant: 恢復此版

# appearance.mode.dark
source: Dark
zh_hans: 深色
zh_hant: 深色

# appearance.mode.light
source: Light
zh_hans: 浅色
zh_hant: 淺色

# appearance.mode.system
source: System
zh_hans: 跟随系统
zh_hant: 跟隨系統

# appearance.modeLabel
source: Theme mode
zh_hans: 主题模式
zh_hant: 主題模式

# appearance.myAvatar
source: My avatar
zh_hans: 我的头像
zh_hant: 我的頭像

# appearance.nameLabel
source: Name
zh_hans: 名称
zh_hant: 名稱

# appearance.namePlaceholder
source: Name this look
zh_hans: 给这个配色取个名字
zh_hant: 給這個配色取個名字

# appearance.nameRequired
source: Give your colors a name first
zh_hans: 先给配色取个名字
zh_hant: 先給配色取個名字

# appearance.permissionDenied
source: Photo library permission is required
zh_hans: 需要相册权限才能选图
zh_hant: 需要相冊權限才能選圖

# appearance.pickWallpaper
source: Choose from photo library
zh_hans: 从相册选择
zh_hant: 從相冊選擇

# appearance.presetsHint
source: Tap a theme to try it on — apply it if you like it.
zh_hans: 点一张试穿，喜欢再点应用。
zh_hant: 點一張試穿，喜歡再點應用。

# appearance.presetsLabel
source: Presets
zh_hans: 预设
zh_hant: 預設

# appearance.preview
source: Live preview
zh_hans: 实时预览
zh_hant: 實時預覽

# appearance.primary
source: Primary
zh_hans: 主色
zh_hant: 主色

# appearance.removeWallpaper
source: Remove wallpaper
zh_hans: 移除壁纸
zh_hant: 移除壁紙

# appearance.restoreDefault
source: Restore default
zh_hans: 恢复默认
zh_hant: 恢復默認

# appearance.rollback
source: Roll back to previous
zh_hans: 恢复上一版
zh_hant: 恢復上一版

# appearance.rollbackNote
source: Nothing sticks until you apply it. You can always go back to the last applied look.
zh_hans: 确认后才会真正保存；随时可以回到上一次确认的样子。
zh_hant: 確認後纔會真正保存；隨時可以回到上一次確認的樣子。

# appearance.safetyTitle
source: Safety net
zh_hans: 安全网
zh_hant: 安全網

# appearance.sampleAi
source: This is an AI reply
zh_hans: 这是一条 AI 回复
zh_hant: 這是一條 AI 回覆

# appearance.sampleUser
source: This is my message
zh_hans: 这是我的消息
zh_hant: 這是我的消息

# appearance.save
source: Save colors
zh_hans: 保存配色
zh_hant: 保存配色

# appearance.saveFailed
source: Couldn't save, please try again
zh_hans: 保存失败，请重试
zh_hant: 保存失敗，請重試

# appearance.saved
source: Saved
zh_hans: 已保存
zh_hant: 已保存

# appearance.secondary
source: Secondary
zh_hans: 副色
zh_hant: 副色

# appearance.shareCameraDenied
source: Camera permission is needed to scan
zh_hans: 需要相机权限才能扫码
zh_hant: 需要相機權限才能掃碼

# appearance.shareClose
source: Close
zh_hans: 关闭
zh_hant: 關閉

# appearance.shareCopied
source: Copied to clipboard
zh_hans: 已复制到剪贴板
zh_hant: 已複製到剪貼板

# appearance.shareCopyJson
source: Copy JSON
zh_hans: 复制 JSON
zh_hant: 複製 JSON

# appearance.shareDoImport
source: Import & try on
zh_hans: 导入并试穿
zh_hant: 導入並試穿

# appearance.shareImportErrorBundle
source: Not a valid theme bundle
zh_hans: 不是有效的主题包
zh_hant: 不是有效的主題包

# appearance.shareImportErrorEmpty
source: Nothing to import
zh_hans: 内容是空的，没什么可导入
zh_hant: 內容是空的，沒什麼可導入

# appearance.shareImportErrorJson
source: Not valid JSON — please check
zh_hans: 不是有效的 JSON，请检查
zh_hant: 不是有效的 JSON，請檢查

# appearance.shareImported
source: Imported — try it on, apply to keep
zh_hans: 已导入并试穿，点应用生效
zh_hant: 已導入並試穿，點應用生效

# appearance.shareLabel
source: Import / Export
zh_hans: 导入 / 导出
zh_hant: 導入 / 導出

# appearance.sharePasteHint
source: Paste the theme JSON here
zh_hans: 把主题 JSON 粘贴到这里
zh_hant: 把主題 JSON 粘貼到這裏

# appearance.sharePasteTitle
source: Paste to import
zh_hans: 粘贴导入
zh_hant: 粘貼導入

# appearance.shareQr
source: QR code
zh_hans: 二维码
zh_hant: 二維碼

# appearance.shareQrTitle
source: Scan to import theme
zh_hans: 扫码导入主题
zh_hant: 掃碼導入主題

# appearance.shareQrTooBig
source: Theme is too big for a QR code — use copy or share instead
zh_hans: 主题太大，二维码装不下，请用复制或分享
zh_hant: 主題太大，二維碼裝不下，請用複製或分享

# appearance.shareRequestingCamera
source: Requesting camera permission…
zh_hans: 正在请求相机权限…
zh_hant: 正在請求相機權限…

# appearance.shareScanQr
source: Scan QR
zh_hans: 扫码导入
zh_hant: 掃碼導入

# appearance.shareStripped
source: Local images (wallpaper/avatar) aren't shared
zh_hans: 本机图片（壁纸/头像）不会被分享出去
zh_hant: 本機圖片（壁紙/頭像）不會被分享出去

# appearance.shareSystem
source: Share…
zh_hans: 系统分享
zh_hant: 系統分享

# appearance.stickerLabel
source: Devil stickers
zh_hans: 小恶魔贴纸
zh_hant: 小惡魔貼紙

# appearance.stickerOption
source: Sticker %1$@
zh_hans: 贴纸 %1$@
zh_hant: 貼紙 %1$@

# appearance.subtitle
source: Themes, wallpaper & avatars
zh_hans: 主题、壁纸与头像
zh_hant: 主題、壁紙與頭像

# appearance.title
source: Appearance
zh_hans: 外观
zh_hant: 外觀

# appearance.tryOn
source: Trying on
zh_hans: 试穿中
zh_hant: 試穿中

# appearance.wallpaperLabel
source: Wallpaper
zh_hans: 壁纸
zh_hant: 壁紙

# appearance.wheelHint
source: Tap the wheel, or drag the slider to fine-tune brightness
zh_hans: 在色轮上点选，或拖动滑杆微调明度
zh_hant: 在色輪上點選，或拖動滑桿微調明度

# artifact.openPdf
source: Open PDF: %1$@
zh_hans: 打开 PDF：%1$@
zh_hant: 打開 PDF：%1$@

# auth.accessKeyLabel
source: Workspace access key
zh_hans: 工作区访问密钥
zh_hant: 工作區訪問密鑰

# auth.accessKeyPlaceholder
source: Needed to connect to a hosted workspace
zh_hans: 连接线上工作区需要
zh_hant: 連接線上工作區需要

# auth.logout
source: Log out
zh_hans: 退出登录
zh_hant: 退出登錄

# auth.noKeyNote
source: No key is needed for a local workspace. Make sure the Dudu server is running at %1$@.
zh_hans: 本地工作区不用密钥。确认嘟嘟服务器在 %1$@ 跑着就行。
zh_hant: 本地工作區不用密鑰。確認嘟嘟服務器在 %1$@ 跑着就行。

# auth.openWorkspace
source: Open workspace
zh_hans: 进入工作区
zh_hant: 進入工作區

# auth.sessionExpired
source: Your session expired. Please sign in again.
zh_hans: 登录已过期，请重新进入。
zh_hant: 登錄已過期，請重新進入。

# auth.unreachable
source: Could not reach your workspace (%1$@).
zh_hans: 连不上你的工作区（%1$@）。
zh_hant: 連不上你的工作區（%1$@）。

# auth.welcome
source: You made it. Dudu is here.
zh_hans: 回来了？嘟嘟在这儿。
zh_hant: 回來了？嘟嘟在這兒。

# backup.backupDone
source: Backup ready
zh_hans: 备份已生成
zh_hant: 備份已生成

# backup.backupDoneWhere
source: The backup file is ready. Save it to the Files app from the share sheet that just opened — otherwise it only lives in the cache, which the system may clean up.
zh_hans: 备份文件已经生成了。刚才弹出的分享面板里把它存到「文件」App 吧，不然它只躺在缓存里，系统可能会清理掉。
zh_hant: 備份文件已經生成了。剛纔彈出的分享面板裏把它存到「文件」App 吧，不然它只躺在緩存裏，系統可能會清理掉。

# backup.confirmRestore
source: Replace current data with this backup? This cannot be undone.
zh_hans: 确定用备份覆盖当前数据吗？此操作不可撤销。
zh_hant: 確定用備份覆蓋當前數據嗎？此操作不可撤銷。

# backup.errors.bad-kind
source: Not a Dudu backup file
zh_hans: 不是嘟嘟备份文件
zh_hant: 不是嘟嘟備份文件

# backup.errors.empty
source: File is empty
zh_hans: 文件是空的
zh_hant: 文件是空的

# backup.errors.invalid-shape
source: Backup file is corrupt
zh_hans: 备份文件损坏
zh_hant: 備份文件損壞

# backup.errors.not-json
source: Not a valid JSON file
zh_hans: 不是有效的 JSON 文件
zh_hant: 不是有效的 JSON 文件
